magicwen666/GSDProduct/GFK-GW-ES/Code/NXPLib/CMSIS/lpc112x/LPC112x.h
typedef struct {                                    /*!< (@ 0x4000C000) CT16B0 Structure                                       */
  __IO uint32_t  IR;                                /*!< (@ 0x4000C000) Interrupt register (IR). The IR can be written
                                                         to clear interrupts. The IR can be read to identify which of
                                                          five possible interrupt sources are pending.                         */
  __IO uint32_t  TCR;                               /*!< (@ 0x4000C004) Timer Control register (TCR). The TCR is used
                                                         to control the Timer Counter functions. The Timer Counter can
                                                          be disabled or reset through the TCR.                                */
  __IO uint32_t  TC;                                /*!< (@ 0x4000C008) Timer Counter (TC). The 32-bit TC is incremented
                                                         every PR+1 cycles of PCLK. The TC is controlled through the
                                                          TCR.                                                                 */
  __IO uint32_t  PR;                                /*!< (@ 0x4000C00C) Prescale register (PR). When the Prescale Counter
                                                         (below) is equal to this value, the next clock increments the
                                                          TC and clears the PC.                                                */
  __IO uint32_t  PC;                                /*!< (@ 0x4000C010) Prescale Counter (PC). The 16-bit PC is a counter
                                                         which is incremented to the value stored in PR. When the value
                                                          in PR is reached, the TC is incremented and the PC is cleared.
                                                          The PC is observable and controllable through the bus interface.     */
  __IO uint32_t  MCR;                               /*!< (@ 0x4000C014) Match Control register (MCR). The MCR is used
                                                         to control if an interrupt is generated and if the TC is reset
                                                          when a Match occurs.                                                 */
  __IO uint32_t  MR[4];                             /*!< (@ 0x4000C018) Match register 0 (MR0). MR0 can be enabled through
                                                         the MCR to reset the TC, stop both the TC and PC, and/or generate
                                                          an interrupt every time MR0 matches the TC.                          */
  __IO uint32_t  CCR;                               /*!< (@ 0x4000C028) Capture Control register (CCR). The CCR controls
                                                         which edges of the capture inputs are used to load the Capture
                                                          registers and whether or not an interrupt is generated when
                                                          a capture takes place.                                               */
  __I  uint32_t  CR[2];                             /*!< (@ 0x4000C02C) Capture register. CR is loaded with the value
                                                         of TC when there is an event on the CT16B0_CAP input.                 */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  EMR;                               /*!< (@ 0x4000C03C) External Match register (EMR). The EMR controls
                                                         the match function and the external match pins CT16B0_MAT[2:0].       */
  __I  uint32_t  RESERVED1[12];
  __IO uint32_t  CTCR;                              /*!< (@ 0x4000C070) Count Control register (CTCR). The CTCR selects
                                                         between Timer and Counter mode, and in Counter mode selects
                                                          the signal and edge(s) for counting.                                 */
  __IO uint32_t  PWMC;                              /*!< (@ 0x4000C074) PWM Control register (PWMCON). The PWMCON enables
                                                         PWM mode for the external match pins CT16B0_MAT[2:0].                 */
} LPC_CT16B0_Type;


/* ================================================================================ */
/* ================                     CT32B0                     ================ */
/* ================================================================================ */


/**
  * @brief 32-bit counter/timer CT32B0/1  (CT32B0)
  */

typedef struct {                                    /*!< (@ 0x40014000) CT32B0 Structure                                       */
  __IO uint32_t  IR;                                /*!< (@ 0x40014000) Interrupt register (IR). The IR can be written
                                                         to clear interrupts. The IR can be read to identify which of
                                                          five possible interrupt sources are pending.                         */
  __IO uint32_t  TCR;                               /*!< (@ 0x40014004) Timer Control register (TCR). The TCR is used
                                                         to control the Timer Counter functions. The Timer Counter can
                                                          be disabled or reset through the TCR.                                */
  __IO uint32_t  TC;                                /*!< (@ 0x40014008) Timer Counter (TC). The 32-bit TC is incremented
                                                         every PR+1 cycles of PCLK. The TC is controlled through the
                                                          TCR.                                                                 */
  __IO uint32_t  PR;                                /*!< (@ 0x4001400C) Prescale register (PR). When the Prescale Counter
                                                         (below) is equal to this value, the next clock increments the
                                                          TC and clears the PC.                                                */
  __IO uint32_t  PC;                                /*!< (@ 0x40014010) Prescale Counter (PC). The 32-bit PC is a counter
                                                         which is incremented to the value stored in PR. When the value
                                                          in PR is reached, the TC is incremented and the PC is cleared.
                                                          The PC is observable and controllable through the bus interface.     */
  __IO uint32_t  MCR;                               /*!< (@ 0x40014014) Match Control register (MCR). The MCR is used
                                                         to control if an interrupt is generated and if the TC is reset
                                                          when a Match occurs.                                                 */
  __IO uint32_t  MR[4];                             /*!< (@ 0x40014018) Match register 0 (MR0). MR0 can be enabled through
                                                         the MCR to reset the TC, stop both the TC and PC, and/or generate
                                                          an interrupt every time MR0 matches the TC.                          */
  __IO uint32_t  CCR;                               /*!< (@ 0x40014028) Capture Control register (CCR). The CCR controls
                                                         which edges of the capture inputs are used to load the Capture
                                                          registers and whether or not an interrupt is generated when
                                                          a capture takes place.                                               */
  __I  uint32_t  CR[2];                             /*!< (@ 0x4001402C) Capture register 0 (CR0). CR0 is loaded with
                                                         the value of TC when there is an event on the CT32B0_CAP0 input.      */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  EMR;                               /*!< (@ 0x4001403C) External Match register (EMR). The EMR controls
                                                         the match function and the external match pins CT32B0_MAT[3:0].       */
  __I  uint32_t  RESERVED1[12];
  __IO uint32_t  CTCR;                              /*!< (@ 0x40014070) Count Control register (CTCR). The CTCR selects
                                                         between Timer and Counter mode, and in Counter mode selects
                                                          the signal and edge(s) for counting.                                 */
  __IO uint32_t  PWMC;                              /*!< (@ 0x40014074) PWM Control register (PWMCON). The PWMCON enables
                                                         PWM mode for the external match pins CT32B0_MAT[3:0].                 */
} LPC_CT32B0_Type;


/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */


/**
  * @brief 12-bit ADC (ADC)
  */

